index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-02 Sat 16:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Praca dyplomowa</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Adam Salwowski" />
<meta name="description" content="Strona portfolio wraz z podadnikami dla początkujących programistów"
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Praca dyplomowa</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb5e332e"><span class="todo TODO">TODO</span> Zapoznać się z tym</a></li>
<li><a href="#org203ebd9">Inspirations for creating this side</a></li>
<li><a href="#orgb26f058">Programming basics</a>
<ul>
<li><a href="#orgf64e5bb">instalacja niezbędnych pakietów</a></li>
<li><a href="#orgcf863eb">konfiguracja środowiska programistycznego (edytor tekstowy Emacs)</a>
<ul>
<li><a href="#org59ee3ff">emacs lisp</a></li>
</ul>
</li>
<li><a href="#org3b3c89e">python</a></li>
<li><a href="#orge1d8d01">html</a></li>
<li><a href="#orga1ce877">css</a></li>
<li><a href="#org0b10a27">java</a></li>
<li><a href="#orgf6568d6">c</a></li>
<li><a href="#org9075d43">c++</a></li>
<li><a href="#org289b1fa">latex</a></li>
<li><a href="#org34f0ca2">markdown</a></li>
<li><a href="#org72b47e3">org-mode</a></li>
<li><a href="#org2b7b94c">regex</a></li>
<li><a href="#org8b14a4b">git</a>
<ul>
<li><a href="#org6a7acf6">Basic commands</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgae36d08">Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb5e332e" class="outline-2">
<h2 id="orgb5e332e"><span class="todo TODO">TODO</span> Zapoznać się z tym</h2>
<div class="outline-text-2" id="text-orgb5e332e">
<p>
<a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</a>
</p>
</div>
</div>
<div id="outline-container-org203ebd9" class="outline-2">
<h2 id="org203ebd9">Inspirations for creating this side</h2>
<div class="outline-text-2" id="text-org203ebd9">
<ul class="org-ul">
<li><a href="https://lukesmith.xyz">https://lukesmith.xyz</a></li>
<li><a href="https://landchad.net">https://landchad.net</a></li>
<li><a href="https://xahlee.info">https://xahlee.info</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb26f058" class="outline-2">
<h2 id="orgb26f058">Programming basics</h2>
<div class="outline-text-2" id="text-orgb26f058">
</div>
<div id="outline-container-orgf64e5bb" class="outline-3">
<h3 id="orgf64e5bb">instalacja niezbędnych pakietów</h3>
</div>
<div id="outline-container-orgcf863eb" class="outline-3">
<h3 id="orgcf863eb">konfiguracja środowiska programistycznego (edytor tekstowy Emacs)</h3>
<div class="outline-text-3" id="text-orgcf863eb">
</div>
<div id="outline-container-org59ee3ff" class="outline-4">
<h4 id="org59ee3ff">emacs lisp</h4>
</div>
</div>
<div id="outline-container-org3b3c89e" class="outline-3">
<h3 id="org3b3c89e">python</h3>
</div>
<div id="outline-container-orge1d8d01" class="outline-3">
<h3 id="orge1d8d01">html</h3>
</div>
<div id="outline-container-orga1ce877" class="outline-3">
<h3 id="orga1ce877">css</h3>
</div>
<div id="outline-container-org0b10a27" class="outline-3">
<h3 id="org0b10a27">java</h3>
</div>
<div id="outline-container-orgf6568d6" class="outline-3">
<h3 id="orgf6568d6">c</h3>
</div>
<div id="outline-container-org9075d43" class="outline-3">
<h3 id="org9075d43">c++</h3>
</div>
<div id="outline-container-org289b1fa" class="outline-3">
<h3 id="org289b1fa">latex</h3>
</div>
<div id="outline-container-org34f0ca2" class="outline-3">
<h3 id="org34f0ca2">markdown</h3>
</div>
<div id="outline-container-org72b47e3" class="outline-3">
<h3 id="org72b47e3">org-mode</h3>
</div>
<div id="outline-container-org2b7b94c" class="outline-3">
<h3 id="org2b7b94c">regex</h3>
</div>
<div id="outline-container-org8b14a4b" class="outline-3">
<h3 id="org8b14a4b">git</h3>
<div class="outline-text-3" id="text-org8b14a4b">
<p>
Git is a fast, scalable, distributed revision control system with an unusually rich command set that provides both high-level operations and full access to internals.
</p>
</div>
<div id="outline-container-org6a7acf6" class="outline-4">
<h4 id="org6a7acf6">Basic commands</h4>
<div class="outline-text-4" id="text-org6a7acf6">
<ul class="org-ul">
<li><p>
Set Up Name and Email Info
</p>
<pre class="example">
git config --global user.name "Mary Lee"
git config --global user.email "mary@example.com"
</pre></li>
<li>Commit Changes to Local Repository
<dl class="org-dl">
<dt>git status</dt><dd>Show current status. (that is, list changed files.)</dd>
<dt>git add .</dt><dd>Add changes from current dir to local repository's staging area.</dd>
<dt>git commit -m"message"</dt><dd>Commit changes to the local repository. The message is a short description of changes you made.</dd>
</dl></li>
<li id="Sync with Remote Repository">To get update from a server, or put your changes to a server , you need to pull or push.
<dl class="org-dl">
<dt>git pull</dt><dd>Pull from remote to your local repository.</dd>
<dt>git push</dt><dd>Push your local repository to remote.</dd>
</dl></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgae36d08" class="outline-2">
<h2 id="orgae36d08">Links</h2>
<div class="outline-text-2" id="text-orgae36d08">
<dl class="org-dl">
<dt>E-mail address</dt><dd><a href="mailto:150998@student.uwm.edu.pl">mailto:150998@student.uwm.edu.pl</a></dd>
<dt>Github</dt><dd><a href="https://github.com/zadca123/">https://github.com/zadca123/</a></dd>
<dt>Gitlab</dt><dd><a href="https://gitlab.com/zadca123/">https://gitlab.com/zadca123/</a></dd>
<dt>Mirror on notabug.org</dt><dd><a href="https://notabug.com/zadca123/">https://notabug.com/zadca123/</a></dd>
<dt>StackOverflow</dt><dd><a href="https://stackoverflow.com/users/17855207/zadca123/">https://stackoverflow.com/users/17855207/zadca123/</a></dd>
<dt>My CV</dt><dd><a href="https://gitlab.com/zadca123/cv/-/blob/master/main.pdf">https://gitlab.com/zadca123/cv/-/blob/master/main.pdf</a></dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Adam Salwowski</p>
<p class="date">Created: 2022-04-02 Sat 16:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
